# Taps
tap "homebrew/bundle"

# Binaries
brew 'git' # Version control
brew 'zsh' # Z shell
brew 'fish' # Friendly Interactive SHell (non-POSIX alternative to bash/zsh)
brew 'stow' # Symlink manager
brew 'zoxide' # switch between most used directories
brew 'htop' # prettier top
brew 'jq' # JSON processor
# brew 'n' # Node version manager
brew 'gh' # GitHub CLI
brew 'fzf' # Fuzzy finder
brew 'fd' # Better find
brew 'rg' # Better grep
brew 'yazi' # Terminal file manager
brew 'git-delta' # Better git diffs
# brew 'gdrive' # Google Drive
# brew 'mas' # Mac App Store installer cli

# Applications
cask 'spotify'
cask 'firefox'
cask 'docker'
cask 'iterm2'
cask 'wezterm'
cask 'visual-studio-code'
cask 'obsidian' # Note-taking app

# Fonts
cask 'font-0xproto-nerd-font'
cask 'font-cascadia-code'
cask 'font-commit-mono'
cask 'font-commit-mono-nerd-font'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
cask 'font-meslo-for-powerlevel10k'

# Mac App Store
# mas 'appname', id: 123456789